In [1]:
import pandas as pd
import numpy as np

In [2]:
purchasers = pd.read_csv("purchasers.csv")

In [3]:
purchasers.head()

  Date of Purchase       Purchaser Name Denomination
0      12/Apr/2019  A B C INDIA LIMITED     1,00,000
1      12/Apr/2019  A B C INDIA LIMITED     1,00,000
2      12/Apr/2019  A B C INDIA LIMITED    10,00,000
3      12/Apr/2019  A B C INDIA LIMITED    10,00,000
4      12/Apr/2019  A B C INDIA LIMITED     1,00,000

In [6]:
purchasers.rename(columns={"Date of Purchase": "date_of_purchase", 
                           "Purchaser Name": "purchaser_name", "Denomination": "denomination"}, inplace=True)

In [7]:
purchasers.head()

  date_of_purchase       purchaser_name denomination
0      12/Apr/2019  A B C INDIA LIMITED     1,00,000
1      12/Apr/2019  A B C INDIA LIMITED     1,00,000
2      12/Apr/2019  A B C INDIA LIMITED    10,00,000
3      12/Apr/2019  A B C INDIA LIMITED    10,00,000
4      12/Apr/2019  A B C INDIA LIMITED     1,00,000

In [9]:
purchasers.dtypes

date_of_purchase    object
purchaser_name      object
denomination        object
dtype: object

In [10]:
purchasers['denomination'] = purchasers['denomination'].str.replace(",", "")

In [11]:
purchasers.head()

  date_of_purchase       purchaser_name denomination
0      12/Apr/2019  A B C INDIA LIMITED       100000
1      12/Apr/2019  A B C INDIA LIMITED       100000
2      12/Apr/2019  A B C INDIA LIMITED      1000000
3      12/Apr/2019  A B C INDIA LIMITED      1000000
4      12/Apr/2019  A B C INDIA LIMITED       100000

In [12]:
purchasers['date_of_purchase'] = pd.to_datetime(purchasers['date_of_purchase'])

In [13]:
purchasers.head()

  date_of_purchase       purchaser_name denomination
0       2019-04-12  A B C INDIA LIMITED       100000
1       2019-04-12  A B C INDIA LIMITED       100000
2       2019-04-12  A B C INDIA LIMITED      1000000
3       2019-04-12  A B C INDIA LIMITED      1000000
4       2019-04-12  A B C INDIA LIMITED       100000

In [14]:
purchasers.shape

(18871, 3)

In [15]:
purchasers.to_csv("purchasers.csv", index=False)

In [16]:
beneficiaries = pd.read_csv("beneficiaries.csv")

In [17]:
beneficiaries.head()

  Date of\rEncashment               Name of the Political Party Denomination
0         12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10,00,000
1         12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10,00,000
2         12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM  1,00,00,000
3         12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10,00,000
4         12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10,00,000

In [18]:
beneficiaries.rename(columns={"Date of\rEncashment": "date_of_encashment", "Name of the Political Party": "political_party", 
                              "Denomination": "denomination"}, inplace=True)

In [19]:
beneficiaries.head()

  date_of_encashment                           political_party denomination
0        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10,00,000
1        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10,00,000
2        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM  1,00,00,000
3        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10,00,000
4        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10,00,000

In [22]:
beneficiaries['denomination'] = beneficiaries['denomination'].str.replace(",", "")

In [26]:
beneficiaries['date_of_encashment'] = pd.to_datetime(beneficiaries['date_of_encashment'])

In [27]:
beneficiaries.head()

  date_of_encashment                           political_party denomination
0         2019-04-12  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM      1000000
1         2019-04-12  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM      1000000
2         2019-04-12  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM     10000000
3         2019-04-12  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM      1000000
4         2019-04-12  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM      1000000

In [29]:
beneficiaries.to_csv("beneficiaries.csv")